3B/ECE358/src/01-Introduction.org
#+title: Introduction
#+author: Arnav Gupta
#+LATEX_HEADER: \usepackage{parskip,darkmode}
#+LATEX_HEADER: \enabledarkmode
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="src/latex.css" />

* What is the Internet?

*Packet switches*: routers or switches that forward packets (chunks of data)

*Communication Links*: fiber, copper, radio, satellite (all have transmission rate)

*Network*: collection of devices, routers, and links managed by an organization

The *Internet* is a network of networks that uses protocols.
It is also a communication infrastructure that provides service to distributed applications
and provides a programming interface to distributed applications through hooks and service options.

Internet standards include RFC (Request for Comments) and IETF (Internet Engineering Task Force).

* What is a Protocol?

*Protocols* define the format, order of messages sent and received among network entities, and
actions taken on message transmission/receipt.

Important protocols include WiFi, Bluetooth, Ethernet, USB, TCP (Transport Control Protocol),
BGP (Border Gateway Protocol), and AKA (Authentication and Key Agreement).

* Network Edge: Hosts, Digital Transmission, Physical Media, Access Network

The *Network Edge* has hosts (clients/servers) that work together to run application programs, with
servers often being in data centers.

In the *client/server model*, the client host requests and receives service from an always-on server.
In the *peer-peer model*, there is minimal/no use of dedicated servers.

*Access networks* are wired or wireless communication links and edge routers.

The *network core* is interconnected routers, such as local/regional/national/global ISPs.

