3B/ECE358/01-Introduction.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-10-20 Sun 02:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Introduction</title>
<meta name="author" content="Arnav Gupta" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="src/latex.css" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Introduction</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc4f30ca">1. What is the Internet?</a></li>
<li><a href="#org9dcead6">2. What is a Protocol?</a></li>
<li><a href="#orgfe63afd">3. Network Edge: Hosts, Digital Transmission, Physical Media, Access Network</a>
<ul>
<li><a href="#orgda85ec4">3.1. Links</a></li>
</ul>
</li>
<li><a href="#org1640a91">4. Network Core: Packet/Circuit Switching, Internet Structure</a></li>
<li><a href="#orgd5ac1aa">5. Performance/QoS: Loss, Delay, Throughput</a>
<ul>
<li><a href="#org0772a06">5.1. Quality of Service (QoS)</a></li>
<li><a href="#org5375b84">5.2. Packet Loss and Delay</a></li>
</ul>
</li>
<li><a href="#orgf1e6f6e">6. Protocol Layers, Service Models</a>
<ul>
<li><a href="#org07bfb1a">6.1. Application Layer</a></li>
<li><a href="#orgbbe48e3">6.2. Transport Layer</a></li>
<li><a href="#org81a4686">6.3. Network Layer</a></li>
<li><a href="#orgd577a8f">6.4. Link Layer and Physical Layer</a></li>
<li><a href="#org23be6c8">6.5. Encapsulation</a></li>
</ul>
</li>
<li><a href="#org6dba7a3">7. History</a>
<ul>
<li><a href="#org35e0e17">7.1. Early Packet-Switching Principles</a></li>
<li><a href="#org135d864">7.2. Internetworking</a></li>
<li><a href="#org5d54105">7.3. New Protocols</a></li>
<li><a href="#org316adf4">7.4. Commercialization</a></li>
<li><a href="#orgc27693f">7.5. Scale, Mobility, Cloud</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgc4f30ca" class="outline-2">
<h2 id="orgc4f30ca"><span class="section-number-2">1.</span> What is the Internet?</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>Packet switches</b>: routers or switches that forward packets (chunks of data)
</p>

<p>
<b>Communication Links</b>: fiber, copper, radio, satellite (all have transmission rate)
</p>

<p>
<b>Network</b>: collection of devices, routers, and links managed by an organization
</p>

<p>
The <b>Internet</b> is a network of networks that uses protocols.
It is also a communication infrastructure that provides service to distributed applications
and provides a programming interface to distributed applications through hooks and service options.
</p>

<p>
Internet standards include RFC (Request for Comments) and IETF (Internet Engineering Task Force).
</p>
</div>
</div>
<div id="outline-container-org9dcead6" class="outline-2">
<h2 id="org9dcead6"><span class="section-number-2">2.</span> What is a Protocol?</h2>
<div class="outline-text-2" id="text-2">
<p>
<b>Protocols</b> define the format, order of messages sent and received among network entities, and
actions taken on message transmission/receipt.
</p>

<p>
Important protocols include WiFi, Bluetooth, Ethernet, USB, TCP (Transport Control Protocol),
BGP (Border Gateway Protocol), and AKA (Authentication and Key Agreement).
</p>
</div>
</div>
<div id="outline-container-orgfe63afd" class="outline-2">
<h2 id="orgfe63afd"><span class="section-number-2">3.</span> Network Edge: Hosts, Digital Transmission, Physical Media, Access Network</h2>
<div class="outline-text-2" id="text-3">
<p>
The <b>Network Edge</b> has hosts (clients/servers) that work together to run application programs, with
servers often being in data centers.
</p>

<p>
In the <b>client/server model</b>, the client host requests and receives service from an always-on server.
In the <b>peer-peer model</b>, there is minimal/no use of dedicated servers.
</p>

<p>
<b>Access networks</b> are wired or wireless communication links and edge routers.
</p>

<p>
The <b>network core</b> is interconnected routers, such as local/regional/national/global ISPs.
</p>
</div>
