3B/ECE358/01-Introduction.tex
% Created 2024-10-20 Sun 02:49
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{parskip,darkmode}
\enabledarkmode
\author{Arnav Gupta}
\date{\today}
\title{Introduction}
\hypersetup{
 pdfauthor={Arnav Gupta},
 pdftitle={Introduction},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.7.11)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{What is the Internet?}
\label{sec:orgafd23fc}

\textbf{Packet switches}: routers or switches that forward packets (chunks of data)

\textbf{Communication Links}: fiber, copper, radio, satellite (all have transmission rate)

\textbf{Network}: collection of devices, routers, and links managed by an organization

The \textbf{Internet} is a network of networks that uses protocols.
It is also a communication infrastructure that provides service to distributed applications
and provides a programming interface to distributed applications through hooks and service options.

Internet standards include RFC (Request for Comments) and IETF (Internet Engineering Task Force).
\section{What is a Protocol?}
\label{sec:orgaa2432c}

\textbf{Protocols} define the format, order of messages sent and received among network entities, and
actions taken on message transmission/receipt.

Important protocols include WiFi, Bluetooth, Ethernet, USB, TCP (Transport Control Protocol),
BGP (Border Gateway Protocol), and AKA (Authentication and Key Agreement).
\section{Network Edge: Hosts, Digital Transmission, Physical Media, Access Network}
\label{sec:org68f713f}

The \textbf{Network Edge} has hosts (clients/servers) that work together to run application programs, with
servers often being in data centers.

In the \textbf{client/server model}, the client host requests and receives service from an always-on server.
In the \textbf{peer-peer model}, there is minimal/no use of dedicated servers.

\textbf{Access networks} are wired or wireless communication links and edge routers.

The \textbf{network core} is interconnected routers, such as local/regional/national/global ISPs.
