3B/ECE358/src/01-Introduction.org
** Links

*Links* perform digital communications. At the lowest level, the transmitter transforms the message
into a signal suitable for transmission over the physical medium by expanding energy.
The steps in the links are:
- *encoder*: to compress and add redundancy to optimize detection at the receiver
- *modulator*: to convert encoder output to a format suitable for the physical medium
- the received signal is a corrupted version of the transmitted signal, but the receiver must extract
  the desired message
- *demodulator*: to convert perturbed received signal to a form suitable for the decoder
- *decoder*: to make the best estimate of the message

The transmission of bits by electromagnetic waves is limited by attenuation (power reduced over distance
traveled), distortion, dispersion (lower power over more distance), and noise.

*Physical Link*: what lies between transmitter and receiver:
- *guided media*: signals propagate in solid media
- *unguided media*: signals propagate freely

Three important characteristics of a transmission system are:
1. *Propagation delay*: time required for signal to travel across media
2. *Bandwidth/Rate*: bandwidth is the max times per second the signal can change (Hz), rate is
   the number of bits that can be transmitted on the link in a given unit of time (depends on length
   of medium and capability of transmitted)
3. *Bit Error Rate (BER)*: probability that a bit is in error

Physical links can be:
- *twisted pair*: inexpensive, two insulated copper wires
- *coaxial cable*: two concentric copper conductors, bidirectional, allows broadband
- *fiber optic cable*: glass fiber carrying light pulses, each pulse a bit, flexible, high-speed
  operation (10s-100s Gbps), and low error rate
- *wireless radio*: signals carried in various bands, broadcast half-duplex (sender to receiver),
  affected by reflection, obstructed by objects, interference, and noise

Residential access networks:
- *digital subscriber line*: use telephone line, where data goes to Internet and voice goes to telephone
- *cable-based access*: use cable TV infrastructure, with hybrid fiber coax (asymmetric, higher download
  rate), network of cable and fiber attaches homes to ISP router where homes share access network
  to cable headend
  - uses *frequency division multiplexing* (FDM) where different channels are transmitted in different
    frequency bands
- *fiber to the home*: optical links from central office to the home using Passive Optical Network (PON)
  or Active Optical Network (AON) like switched Ethernet and has much higher rates

Access networks:
- *enterprise networks*: mix of wired/wireless links connecting a mix of switches and routers
- *data center networks*: high-bandwidth links connect 100s to 1000s of servers together and to Internet

