3B/ECE358/01-Introduction.html
<div id="outline-container-orgda85ec4" class="outline-3">
<h3 id="orgda85ec4"><span class="section-number-3">3.1.</span> Links</h3>
<div class="outline-text-3" id="text-3-1">
<p>
<b>Links</b> perform digital communications. At the lowest level, the transmitter transforms the message
into a signal suitable for transmission over the physical medium by expanding energy.
The steps in the links are:
</p>
<ul class="org-ul">
<li><b>encoder</b>: to compress and add redundancy to optimize detection at the receiver</li>
<li><b>modulator</b>: to convert encoder output to a format suitable for the physical medium</li>
<li>the received signal is a corrupted version of the transmitted signal, but the receiver must extract
the desired message</li>
<li><b>demodulator</b>: to convert perturbed received signal to a form suitable for the decoder</li>
<li><b>decoder</b>: to make the best estimate of the message</li>
</ul>

<p>
The transmission of bits by electromagnetic waves is limited by attenuation (power reduced over distance
traveled), distortion, dispersion (lower power over more distance), and noise.
</p>

<p>
<b>Physical Link</b>: what lies between transmitter and receiver:
</p>
<ul class="org-ul">
<li><b>guided media</b>: signals propagate in solid media</li>
<li><b>unguided media</b>: signals propagate freely</li>
</ul>

<p>
Three important characteristics of a transmission system are:
</p>
<ol class="org-ol">
<li><b>Propagation delay</b>: time required for signal to travel across media</li>
<li><b>Bandwidth/Rate</b>: bandwidth is the max times per second the signal can change (Hz), rate is
the number of bits that can be transmitted on the link in a given unit of time (depends on length
of medium and capability of transmitted)</li>
<li><b>Bit Error Rate (BER)</b>: probability that a bit is in error</li>
</ol>

<p>
Physical links can be:
</p>
<ul class="org-ul">
<li><b>twisted pair</b>: inexpensive, two insulated copper wires</li>
<li><b>coaxial cable</b>: two concentric copper conductors, bidirectional, allows broadband</li>
<li><b>fiber optic cable</b>: glass fiber carrying light pulses, each pulse a bit, flexible, high-speed
operation (10s-100s Gbps), and low error rate</li>
<li><b>wireless radio</b>: signals carried in various bands, broadcast half-duplex (sender to receiver),
affected by reflection, obstructed by objects, interference, and noise</li>
</ul>

<p>
Residential access networks:
</p>
<ul class="org-ul">
<li><b>digital subscriber line</b>: use telephone line, where data goes to Internet and voice goes to telephone</li>
<li><b>cable-based access</b>: use cable TV infrastructure, with hybrid fiber coax (asymmetric, higher download
rate), network of cable and fiber attaches homes to ISP router where homes share access network
to cable headend
<ul class="org-ul">
<li>uses <b>frequency division multiplexing</b> (FDM) where different channels are transmitted in different
frequency bands</li>
</ul></li>
<li><b>fiber to the home</b>: optical links from central office to the home using Passive Optical Network (PON)
or Active Optical Network (AON) like switched Ethernet and has much higher rates</li>
</ul>

<p>
Access networks:
</p>
<ul class="org-ul">
<li><b>enterprise networks</b>: mix of wired/wireless links connecting a mix of switches and routers</li>
<li><b>data center networks</b>: high-bandwidth links connect 100s to 1000s of servers together and to Internet</li>
</ul>
</div>
</div>
</div>
