3B/ECE358/01-Introduction.tex
\subsection{Links}
\label{sec:org5a5a562}

\textbf{Links} perform digital communications. At the lowest level, the transmitter transforms the message
into a signal suitable for transmission over the physical medium by expanding energy.
The steps in the links are:
\begin{itemize}
\item \textbf{encoder}: to compress and add redundancy to optimize detection at the receiver
\item \textbf{modulator}: to convert encoder output to a format suitable for the physical medium
\item the received signal is a corrupted version of the transmitted signal, but the receiver must extract
the desired message
\item \textbf{demodulator}: to convert perturbed received signal to a form suitable for the decoder
\item \textbf{decoder}: to make the best estimate of the message
\end{itemize}

The transmission of bits by electromagnetic waves is limited by attenuation (power reduced over distance
traveled), distortion, dispersion (lower power over more distance), and noise.

\textbf{Physical Link}: what lies between transmitter and receiver:
\begin{itemize}
\item \textbf{guided media}: signals propagate in solid media
\item \textbf{unguided media}: signals propagate freely
\end{itemize}

Three important characteristics of a transmission system are:
\begin{enumerate}
\item \textbf{Propagation delay}: time required for signal to travel across media
\item \textbf{Bandwidth/Rate}: bandwidth is the max times per second the signal can change (Hz), rate is
the number of bits that can be transmitted on the link in a given unit of time (depends on length
of medium and capability of transmitted)
\item \textbf{Bit Error Rate (BER)}: probability that a bit is in error
\end{enumerate}

Physical links can be:
\begin{itemize}
\item \textbf{twisted pair}: inexpensive, two insulated copper wires
\item \textbf{coaxial cable}: two concentric copper conductors, bidirectional, allows broadband
\item \textbf{fiber optic cable}: glass fiber carrying light pulses, each pulse a bit, flexible, high-speed
operation (10s-100s Gbps), and low error rate
\item \textbf{wireless radio}: signals carried in various bands, broadcast half-duplex (sender to receiver),
affected by reflection, obstructed by objects, interference, and noise
\end{itemize}

Residential access networks:
\begin{itemize}
\item \textbf{digital subscriber line}: use telephone line, where data goes to Internet and voice goes to telephone
\item \textbf{cable-based access}: use cable TV infrastructure, with hybrid fiber coax (asymmetric, higher download
rate), network of cable and fiber attaches homes to ISP router where homes share access network
to cable headend
\begin{itemize}
\item uses \textbf{frequency division multiplexing} (FDM) where different channels are transmitted in different
frequency bands
\end{itemize}
\item \textbf{fiber to the home}: optical links from central office to the home using Passive Optical Network (PON)
or Active Optical Network (AON) like switched Ethernet and has much higher rates
\end{itemize}

Access networks:
\begin{itemize}
\item \textbf{enterprise networks}: mix of wired/wireless links connecting a mix of switches and routers
\item \textbf{data center networks}: high-bandwidth links connect 100s to 1000s of servers together and to Internet
\end{itemize}
