3B/ECE358/src/01-Introduction.org
* Network Core: Packet/Circuit Switching, Internet Structure
Three ways to link users together: fully meshed, every node connected to central switch, and hierarchical
network with shared inter-switch links

*Switch*: device that enables the forwarding of info from any input link to any output link

*Packet-switching*: hosts break application layer messages into packets where the network forwards packets
from one router to the next, across links on the path from source to destination

Two key network-core functions:
- *forwarding*: move arriving packets from router's input link to appropriate router output link
- *routing*: determine source-destination paths taken by packets (routing algos)

Packet-switching at the source consists of hosts that take application messages, break them into packets,
and transmit packets into access networks, where links can have capacity.

Packet transmission delay is $L/R$ where $L$ is the packet length and $R$ is the transmission rate.
Switches can have some propagation delay.

*Store and forward*: entire packet must arrive at router before it can be transmitted on the next link

*Pipelining effect*: packets shouldn't be too big so packets can be pipelined

The generic packet switch has *buffers* that store, process, and forward and are in need of smart scheduling
and discarding policies. They control info in packets.

Packets share resources without reservation so the packet to be transmitted next receives full rate.

If arrival rate to link exceeds transmission rate of the link, packets will queue, waiting to be transmitted
on the output link and packets can be dropped if the buffer fills up.

In *circuit switching*, network resources are statically divided into small pieces called circuits:
- end-to-end resources allocated, reserved for flow between source and destination
- there is no sharing (except for sharing of the link), guaranteed performance

*Frequency Division Multiplexing* uses optimal EMFs divided into narrow frequency bands, where each call
is allocated its own band and can transmit at max rate of that narrow band.

*Time Division Multiplexing* divides time into periodic frames where each call is allocated some slot and
can transmit at the max rate only during its time slot.

Packet switching allows more users than circuit switching.
Packet switching is better for bursty data.
Excessive congestion (packet delay and loss due to buffer overflow) is possible, so protocols are needed
for reliable data transfer.

In the Internet, hosts connect via ISPs and so *access ISPs* must be interconnected so that any hosts
can send packets to each other.
This can be done by connecting access ISPs to a single *global transit ISP*.
Global ISPs can be connected with *Internet exchange points*.
There may also be *regional ISPs* that connect *access ISPs* to *global ISPs*.
*Content provider networks* also connect data centers to the Internet, bypassing global and regional ISPs.

* Performance/QoS: Loss, Delay, Throughput
Errors in data networks include:
- bit-level errors
- link and node failures
- packets are delayed
- third party eavesdrop

** Quality of Service (QoS)
Users must be able to rely on the network, so they focus on some QoS metric(s) like:
- packet loss
- delay
- delay variation
- rates
- ease of installation/maintenance
- availability/reliability
- QoS differentiation
- privacy
- security

Today the Internet is best effort, so no guarantees.

Users must be willing to pay for QoS.
Providing a guarantee implies reservation and costly traffic management infrastructure.

