3B/ECE358/01-Introduction.html
<div id="outline-container-org1640a91" class="outline-2">
<h2 id="org1640a91"><span class="section-number-2">4.</span> Network Core: Packet/Circuit Switching, Internet Structure</h2>
<div class="outline-text-2" id="text-4">
<p>
Three ways to link users together: fully meshed, every node connected to central switch, and hierarchical
network with shared inter-switch links
</p>

<p>
<b>Switch</b>: device that enables the forwarding of info from any input link to any output link
</p>

<p>
<b>Packet-switching</b>: hosts break application layer messages into packets where the network forwards packets
from one router to the next, across links on the path from source to destination
</p>

<p>
Two key network-core functions:
</p>
<ul class="org-ul">
<li><b>forwarding</b>: move arriving packets from router&rsquo;s input link to appropriate router output link</li>
<li><b>routing</b>: determine source-destination paths taken by packets (routing algos)</li>
</ul>

<p>
Packet-switching at the source consists of hosts that take application messages, break them into packets,
and transmit packets into access networks, where links can have capacity.
</p>

<p>
Packet transmission delay is \(L/R\) where \(L\) is the packet length and \(R\) is the transmission rate.
Switches can have some propagation delay.
</p>

<p>
<b>Store and forward</b>: entire packet must arrive at router before it can be transmitted on the next link
</p>

<p>
<b>Pipelining effect</b>: packets shouldn&rsquo;t be too big so packets can be pipelined
</p>

<p>
The generic packet switch has <b>buffers</b> that store, process, and forward and are in need of smart scheduling
and discarding policies. They control info in packets.
</p>

<p>
Packets share resources without reservation so the packet to be transmitted next receives full rate.
</p>

<p>
If arrival rate to link exceeds transmission rate of the link, packets will queue, waiting to be transmitted
on the output link and packets can be dropped if the buffer fills up.
</p>

<p>
In <b>circuit switching</b>, network resources are statically divided into small pieces called circuits:
</p>
<ul class="org-ul">
<li>end-to-end resources allocated, reserved for flow between source and destination</li>
<li>there is no sharing (except for sharing of the link), guaranteed performance</li>
</ul>

<p>
<b>Frequency Division Multiplexing</b> uses optimal EMFs divided into narrow frequency bands, where each call
is allocated its own band and can transmit at max rate of that narrow band.
</p>

<p>
<b>Time Division Multiplexing</b> divides time into periodic frames where each call is allocated some slot and
can transmit at the max rate only during its time slot.
</p>

<p>
Packet switching allows more users than circuit switching.
Packet switching is better for bursty data.
Excessive congestion (packet delay and loss due to buffer overflow) is possible, so protocols are needed
for reliable data transfer.
</p>

<p>
In the Internet, hosts connect via ISPs and so <b>access ISPs</b> must be interconnected so that any hosts
can send packets to each other.
This can be done by connecting access ISPs to a single <b>global transit ISP</b>.
Global ISPs can be connected with <b>Internet exchange points</b>.
There may also be <b>regional ISPs</b> that connect <b>access ISPs</b> to <b>global ISPs</b>.
<b>Content provider networks</b> also connect data centers to the Internet, bypassing global and regional ISPs.
</p>
</div>
</div>
<div id="outline-container-orgd5ac1aa" class="outline-2">
<h2 id="orgd5ac1aa"><span class="section-number-2">5.</span> Performance/QoS: Loss, Delay, Throughput</h2>
<div class="outline-text-2" id="text-5">
<p>
Errors in data networks include:
</p>
<ul class="org-ul">
<li>bit-level errors</li>
<li>link and node failures</li>
<li>packets are delayed</li>
<li>third party eavesdrop</li>
</ul>
</div>
<div id="outline-container-org0772a06" class="outline-3">
<h3 id="org0772a06"><span class="section-number-3">5.1.</span> Quality of Service (QoS)</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Users must be able to rely on the network, so they focus on some QoS metric(s) like:
</p>
<ul class="org-ul">
<li>packet loss</li>
<li>delay</li>
<li>delay variation</li>
<li>rates</li>
<li>ease of installation/maintenance</li>
<li>availability/reliability</li>
<li>QoS differentiation</li>
<li>privacy</li>
<li>security</li>
</ul>

<p>
Today the Internet is best effort, so no guarantees.
</p>

<p>
Users must be willing to pay for QoS.
Providing a guarantee implies reservation and costly traffic management infrastructure.
</p>
</div>
</div>
