3B/ECE358/01-Introduction.tex
\section{Network Core: Packet/Circuit Switching, Internet Structure}
\label{sec:org4d85718}
Three ways to link users together: fully meshed, every node connected to central switch, and hierarchical
network with shared inter-switch links

\textbf{Switch}: device that enables the forwarding of info from any input link to any output link

\textbf{Packet-switching}: hosts break application layer messages into packets where the network forwards packets
from one router to the next, across links on the path from source to destination

Two key network-core functions:
\begin{itemize}
\item \textbf{forwarding}: move arriving packets from router's input link to appropriate router output link
\item \textbf{routing}: determine source-destination paths taken by packets (routing algos)
\end{itemize}

Packet-switching at the source consists of hosts that take application messages, break them into packets,
and transmit packets into access networks, where links can have capacity.

Packet transmission delay is \(L/R\) where \(L\) is the packet length and \(R\) is the transmission rate.
Switches can have some propagation delay.

\textbf{Store and forward}: entire packet must arrive at router before it can be transmitted on the next link

\textbf{Pipelining effect}: packets shouldn't be too big so packets can be pipelined

The generic packet switch has \textbf{buffers} that store, process, and forward and are in need of smart scheduling
and discarding policies. They control info in packets.

Packets share resources without reservation so the packet to be transmitted next receives full rate.

If arrival rate to link exceeds transmission rate of the link, packets will queue, waiting to be transmitted
on the output link and packets can be dropped if the buffer fills up.

In \textbf{circuit switching}, network resources are statically divided into small pieces called circuits:
\begin{itemize}
\item end-to-end resources allocated, reserved for flow between source and destination
\item there is no sharing (except for sharing of the link), guaranteed performance
\end{itemize}

\textbf{Frequency Division Multiplexing} uses optimal EMFs divided into narrow frequency bands, where each call
is allocated its own band and can transmit at max rate of that narrow band.

\textbf{Time Division Multiplexing} divides time into periodic frames where each call is allocated some slot and
can transmit at the max rate only during its time slot.

Packet switching allows more users than circuit switching.
Packet switching is better for bursty data.
Excessive congestion (packet delay and loss due to buffer overflow) is possible, so protocols are needed
for reliable data transfer.

In the Internet, hosts connect via ISPs and so \textbf{access ISPs} must be interconnected so that any hosts
can send packets to each other.
This can be done by connecting access ISPs to a single \textbf{global transit ISP}.
Global ISPs can be connected with \textbf{Internet exchange points}.
There may also be \textbf{regional ISPs} that connect \textbf{access ISPs} to \textbf{global ISPs}.
\textbf{Content provider networks} also connect data centers to the Internet, bypassing global and regional ISPs.
\section{Performance/QoS: Loss, Delay, Throughput}
\label{sec:org8835def}
Errors in data networks include:
\begin{itemize}
\item bit-level errors
\item link and node failures
\item packets are delayed
\item third party eavesdrop
\end{itemize}
\subsection{Quality of Service (QoS)}
\label{sec:orgd4b6cdf}
Users must be able to rely on the network, so they focus on some QoS metric(s) like:
\begin{itemize}
\item packet loss
\item delay
\item delay variation
\item rates
\item ease of installation/maintenance
\item availability/reliability
\item QoS differentiation
\item privacy
\item security
\end{itemize}

Today the Internet is best effort, so no guarantees.

Users must be willing to pay for QoS.
Providing a guarantee implies reservation and costly traffic management infrastructure.
