3B/ECE358/src/01-Introduction.org
** Packet Loss and Delay
Packets queue in router buffers, waiting for transmission, so *loss* occurs when buffer fills up.
Lost packets may be retransmitted by previous node, source end system, or not at all.

The packet being transmitted has _transmission delay_, packets in the buffer have
_queueing delay_, checking packets for bit errors gives _nodal processing delay_,
and delay from the packet being propagated is _propagation delay_:
- Nodal processing delay: check bit errors, determine output link, $< \mu \text{s}$
- Queueing delay: time waiting for transmission, based on congestion of buffer
- Transmission delay: $L/R$ for packet length $L$ and link transmission rate $R$
- Propagation delay: $d/s$ for physical link $d$ and propagation speed $s$

Packet queueing delay is
$$ \frac{La}{R} $$
for average packet arrival rate $a$, packet length $L$, and link bandwidth (bit transmission rate) $R$:
- queueing delay close to 0 means average queueing delay small
- queueing delay close to 1 means average queueing delay large
- queueing delay above 1 means average queueing delay infinite

*Throughput*: rate (bits/time unit) at which bits are being sent from sender to receiver
- *instantaneous*: rate at given point in time
- *average*: rate over longer period of time

*Bottleneck link*: link on end-to-end path that constrains end-to-end throughput,
which is the link with lower throughput

If a link is shared, the per-connection end-to-end throughput considers the link's rate divided
by the number of connections.

* Protocol Layers, Service Models
*Layers*: each layer implements a service with its own internal-layer actions and relying on services
from the layer below

Layering provides structure to identify system pieces and modularization allows for easier
maintenance/updates (just change that layer rather than the whole system).

Internet protocol stack:
- *application*: supports network applications (HTTP, IMAP, SMTP, DNS)
- *transport*: process-to-process data transfer (TCP, UDP)
- *network*: routing datagrams from source to destination (IP, routing protocols)
- *link*: data transfer between neighbouring network elements (Ethernet, WiFi, PPP)
- *physical*: bits on the wire

** Application Layer
Distributed over multiple end systems with the application in one end system using the protocol
to exchange data with the application in another end system.

*Message*: data unit at the application layer

** Transport Layer
*Process*: application endpoints

Two transport protocols in the Internet:
- *TCP*: connection-oriented service to applications
  - guaranteed delivery of messages
  - flow control
  - congestion control
- *UDP*: connectionless service
  - no reliability
  - no flow control
  - no congestion control

*Segment*: data unit at the transport layer

** Network Layer
*Datagram*: data unit at the network layer

TCP or UDP in a host passes a segment and destination address.
Routing protocols determine the routes that datagrams take between sources and destination.

** Link Layer and Physical Layer
Work hop-by-hop, from link to link.
A datagram may be handled by different link-layer protocols at different links along its route.

*Frame*: data unit at the link layer

Physical layer moves bits from one node to the next, with protocols depending on the transmission
medium.

** Encapsulation
Transport layer protocol encapsulates message with transport layer header to create segment.

Network layer protocol encapsulates segment with network layer header to create datagram.

Link layer protocol encapsulates datagram with link layer header to create frame.

* History
** Early Packet-Switching Principles
1961, Kleinrock: queueing theory shows effectiveness of packet-switching

1964, Baran: packet-switching in military nets

1967: ARPAnet conceived by Advanced Research Projects Agency

1969: first ARPAnet node operational

1972: ARPAnet public demo, first email program, ARPAnet has 15 nodes

