3B/ECE358/01-Introduction.html
<div id="outline-container-org5375b84" class="outline-3">
<h3 id="org5375b84"><span class="section-number-3">5.2.</span> Packet Loss and Delay</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Packets queue in router buffers, waiting for transmission, so <b>loss</b> occurs when buffer fills up.
Lost packets may be retransmitted by previous node, source end system, or not at all.
</p>

<p>
The packet being transmitted has <span class="underline">transmission delay</span>, packets in the buffer have
<span class="underline">queueing delay</span>, checking packets for bit errors gives <span class="underline">nodal processing delay</span>,
and delay from the packet being propagated is <span class="underline">propagation delay</span>:
</p>
<ul class="org-ul">
<li>Nodal processing delay: check bit errors, determine output link, \(< \mu \text{s}\)</li>
<li>Queueing delay: time waiting for transmission, based on congestion of buffer</li>
<li>Transmission delay: \(L/R\) for packet length \(L\) and link transmission rate \(R\)</li>
<li>Propagation delay: \(d/s\) for physical link \(d\) and propagation speed \(s\)</li>
</ul>

<p>
Packet queueing delay is
\[ \frac{La}{R} \]
for average packet arrival rate \(a\), packet length \(L\), and link bandwidth (bit transmission rate) \(R\):
</p>
<ul class="org-ul">
<li>queueing delay close to 0 means average queueing delay small</li>
<li>queueing delay close to 1 means average queueing delay large</li>
<li>queueing delay above 1 means average queueing delay infinite</li>
</ul>

<p>
<b>Throughput</b>: rate (bits/time unit) at which bits are being sent from sender to receiver
</p>
<ul class="org-ul">
<li><b>instantaneous</b>: rate at given point in time</li>
<li><b>average</b>: rate over longer period of time</li>
</ul>

<p>
<b>Bottleneck link</b>: link on end-to-end path that constrains end-to-end throughput,
which is the link with lower throughput
</p>

<p>
If a link is shared, the per-connection end-to-end throughput considers the link&rsquo;s rate divided
by the number of connections.
</p>
</div>
</div>
</div>
<div id="outline-container-orgf1e6f6e" class="outline-2">
<h2 id="orgf1e6f6e"><span class="section-number-2">6.</span> Protocol Layers, Service Models</h2>
<div class="outline-text-2" id="text-6">
<p>
<b>Layers</b>: each layer implements a service with its own internal-layer actions and relying on services
from the layer below
</p>

<p>
Layering provides structure to identify system pieces and modularization allows for easier
maintenance/updates (just change that layer rather than the whole system).
</p>

<p>
Internet protocol stack:
</p>
<ul class="org-ul">
<li><b>application</b>: supports network applications (HTTP, IMAP, SMTP, DNS)</li>
<li><b>transport</b>: process-to-process data transfer (TCP, UDP)</li>
<li><b>network</b>: routing datagrams from source to destination (IP, routing protocols)</li>
<li><b>link</b>: data transfer between neighbouring network elements (Ethernet, WiFi, PPP)</li>
<li><b>physical</b>: bits on the wire</li>
</ul>
</div>
<div id="outline-container-org07bfb1a" class="outline-3">
<h3 id="org07bfb1a"><span class="section-number-3">6.1.</span> Application Layer</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Distributed over multiple end systems with the application in one end system using the protocol
to exchange data with the application in another end system.
</p>

<p>
<b>Message</b>: data unit at the application layer
</p>
</div>
</div>
<div id="outline-container-orgbbe48e3" class="outline-3">
<h3 id="orgbbe48e3"><span class="section-number-3">6.2.</span> Transport Layer</h3>
<div class="outline-text-3" id="text-6-2">
<p>
<b>Process</b>: application endpoints
</p>

<p>
Two transport protocols in the Internet:
</p>
<ul class="org-ul">
<li><b>TCP</b>: connection-oriented service to applications
<ul class="org-ul">
<li>guaranteed delivery of messages</li>
<li>flow control</li>
<li>congestion control</li>
</ul></li>
<li><b>UDP</b>: connectionless service
<ul class="org-ul">
<li>no reliability</li>
<li>no flow control</li>
<li>no congestion control</li>
</ul></li>
</ul>

<p>
<b>Segment</b>: data unit at the transport layer
</p>
</div>
</div>
<div id="outline-container-org81a4686" class="outline-3">
<h3 id="org81a4686"><span class="section-number-3">6.3.</span> Network Layer</h3>
<div class="outline-text-3" id="text-6-3">
<p>
<b>Datagram</b>: data unit at the network layer
</p>

<p>
TCP or UDP in a host passes a segment and destination address.
Routing protocols determine the routes that datagrams take between sources and destination.
</p>
</div>
</div>
<div id="outline-container-orgd577a8f" class="outline-3">
<h3 id="orgd577a8f"><span class="section-number-3">6.4.</span> Link Layer and Physical Layer</h3>
<div class="outline-text-3" id="text-6-4">
<p>
Work hop-by-hop, from link to link.
A datagram may be handled by different link-layer protocols at different links along its route.
</p>

<p>
<b>Frame</b>: data unit at the link layer
</p>

<p>
Physical layer moves bits from one node to the next, with protocols depending on the transmission
medium.
</p>
</div>
</div>
<div id="outline-container-org23be6c8" class="outline-3">
<h3 id="org23be6c8"><span class="section-number-3">6.5.</span> Encapsulation</h3>
<div class="outline-text-3" id="text-6-5">
<p>
Transport layer protocol encapsulates message with transport layer header to create segment.
</p>

<p>
Network layer protocol encapsulates segment with network layer header to create datagram.
</p>

<p>
Link layer protocol encapsulates datagram with link layer header to create frame.
</p>
</div>
</div>
</div>
<div id="outline-container-org6dba7a3" class="outline-2">
<h2 id="org6dba7a3"><span class="section-number-2">7.</span> History</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org35e0e17" class="outline-3">
<h3 id="org35e0e17"><span class="section-number-3">7.1.</span> Early Packet-Switching Principles</h3>
<div class="outline-text-3" id="text-7-1">
<p>
1961, Kleinrock: queueing theory shows effectiveness of packet-switching
</p>

<p>
1964, Baran: packet-switching in military nets
</p>

<p>
1967: ARPAnet conceived by Advanced Research Projects Agency
</p>

<p>
1969: first ARPAnet node operational
</p>

<p>
1972: ARPAnet public demo, first email program, ARPAnet has 15 nodes
</p>
</div>
</div>
