3B/ECE358/01-Introduction.tex
\subsection{Packet Loss and Delay}
\label{sec:orgec7d5bb}
Packets queue in router buffers, waiting for transmission, so \textbf{loss} occurs when buffer fills up.
Lost packets may be retransmitted by previous node, source end system, or not at all.

The packet being transmitted has \uline{transmission delay}, packets in the buffer have
\uline{queueing delay}, checking packets for bit errors gives \uline{nodal processing delay},
and delay from the packet being propagated is \uline{propagation delay}:
\begin{itemize}
\item Nodal processing delay: check bit errors, determine output link, \(< \mu \text{s}\)
\item Queueing delay: time waiting for transmission, based on congestion of buffer
\item Transmission delay: \(L/R\) for packet length \(L\) and link transmission rate \(R\)
\item Propagation delay: \(d/s\) for physical link \(d\) and propagation speed \(s\)
\end{itemize}

Packet queueing delay is
$$ \frac{La}{R} $$
for average packet arrival rate \(a\), packet length \(L\), and link bandwidth (bit transmission rate) \(R\):
\begin{itemize}
\item queueing delay close to 0 means average queueing delay small
\item queueing delay close to 1 means average queueing delay large
\item queueing delay above 1 means average queueing delay infinite
\end{itemize}

\textbf{Throughput}: rate (bits/time unit) at which bits are being sent from sender to receiver
\begin{itemize}
\item \textbf{instantaneous}: rate at given point in time
\item \textbf{average}: rate over longer period of time
\end{itemize}

\textbf{Bottleneck link}: link on end-to-end path that constrains end-to-end throughput,
which is the link with lower throughput

If a link is shared, the per-connection end-to-end throughput considers the link's rate divided
by the number of connections.
\section{Protocol Layers, Service Models}
\label{sec:org971d297}
\textbf{Layers}: each layer implements a service with its own internal-layer actions and relying on services
from the layer below

Layering provides structure to identify system pieces and modularization allows for easier
maintenance/updates (just change that layer rather than the whole system).

Internet protocol stack:
\begin{itemize}
\item \textbf{application}: supports network applications (HTTP, IMAP, SMTP, DNS)
\item \textbf{transport}: process-to-process data transfer (TCP, UDP)
\item \textbf{network}: routing datagrams from source to destination (IP, routing protocols)
\item \textbf{link}: data transfer between neighbouring network elements (Ethernet, WiFi, PPP)
\item \textbf{physical}: bits on the wire
\end{itemize}
\subsection{Application Layer}
\label{sec:org5544773}
Distributed over multiple end systems with the application in one end system using the protocol
to exchange data with the application in another end system.

\textbf{Message}: data unit at the application layer
\subsection{Transport Layer}
\label{sec:orgbe3e99a}
\textbf{Process}: application endpoints

Two transport protocols in the Internet:
\begin{itemize}
\item \textbf{TCP}: connection-oriented service to applications
\begin{itemize}
\item guaranteed delivery of messages
\item flow control
\item congestion control
\end{itemize}
\item \textbf{UDP}: connectionless service
\begin{itemize}
\item no reliability
\item no flow control
\item no congestion control
\end{itemize}
\end{itemize}

\textbf{Segment}: data unit at the transport layer
\subsection{Network Layer}
\label{sec:org7f285fa}
\textbf{Datagram}: data unit at the network layer

TCP or UDP in a host passes a segment and destination address.
Routing protocols determine the routes that datagrams take between sources and destination.
\subsection{Link Layer and Physical Layer}
\label{sec:org26d88b2}
Work hop-by-hop, from link to link.
A datagram may be handled by different link-layer protocols at different links along its route.

\textbf{Frame}: data unit at the link layer

Physical layer moves bits from one node to the next, with protocols depending on the transmission
medium.
\subsection{Encapsulation}
\label{sec:org532c937}
Transport layer protocol encapsulates message with transport layer header to create segment.

Network layer protocol encapsulates segment with network layer header to create datagram.

Link layer protocol encapsulates datagram with link layer header to create frame.
\section{History}
\label{sec:orga1f4f54}
\subsection{Early Packet-Switching Principles}
\label{sec:org6ef9964}
1961, Kleinrock: queueing theory shows effectiveness of packet-switching

1964, Baran: packet-switching in military nets

1967: ARPAnet conceived by Advanced Research Projects Agency

1969: first ARPAnet node operational

1972: ARPAnet public demo, first email program, ARPAnet has 15 nodes
