3B/ECE358/src/01-Introduction.org
** Internetworking
1970: ALOHAnet satellite network in Hawaii

1974, Cerf and Kahn: architecure for interconnecting networks
- minimalism and autonomy: no internal changes required to interconnected networks
- best-effort service model
- stateless routing
- decentralized control

1976: Ethernet at Xerox PARC

1979: ARPAnet at 200 nodes

** New Protocols
1983: deployment of TCP/IP

1982: SMTP email protocol defined

1983: DNS defined for name-to-IP-address translation

1988: TCP congestion control

New national networks: CSnet, BITnet, NSFnet, Minitel

100,000 hosts connected to confederation of networks.

** Commercialization
Early 1990s: ARPAnet decommissioned, web begins
- hypertext
- HTML, HTTP: Berners-Lee

1994: Mosaic, later Netscape

Late 1990s: commercialization of the web

Late 1990s to 2000s:
- more applications (instant messaging, file sharing)
- network security to forefront
- estimated 50 million hosts, 100+ million users
- backbone links running at Gbps

** Scale, Mobility, Cloud
Aggressive deployment of broadband (10-100s Mbps) and increasing ubiquity of high-speed wireless
(4G/5G, WiFi).

Service providers create their own networks to connect close to end user.

Enterprises run their services in the cloud.

2017: rise of smartphones, so more mobile than fixed devices on the Internet, ~18B devices attached to
the Internet
