3B/ECE358/01-Introduction.html
<div id="outline-container-org135d864" class="outline-3">
<h3 id="org135d864"><span class="section-number-3">7.2.</span> Internetworking</h3>
<div class="outline-text-3" id="text-7-2">
<p>
1970: ALOHAnet satellite network in Hawaii
</p>

<p>
1974, Cerf and Kahn: architecure for interconnecting networks
</p>
<ul class="org-ul">
<li>minimalism and autonomy: no internal changes required to interconnected networks</li>
<li>best-effort service model</li>
<li>stateless routing</li>
<li>decentralized control</li>
</ul>

<p>
1976: Ethernet at Xerox PARC
</p>

<p>
1979: ARPAnet at 200 nodes
</p>
</div>
</div>
<div id="outline-container-org5d54105" class="outline-3">
<h3 id="org5d54105"><span class="section-number-3">7.3.</span> New Protocols</h3>
<div class="outline-text-3" id="text-7-3">
<p>
1983: deployment of TCP/IP
</p>

<p>
1982: SMTP email protocol defined
</p>

<p>
1983: DNS defined for name-to-IP-address translation
</p>

<p>
1988: TCP congestion control
</p>

<p>
New national networks: CSnet, BITnet, NSFnet, Minitel
</p>

<p>
100,000 hosts connected to confederation of networks.
</p>
</div>
</div>
<div id="outline-container-org316adf4" class="outline-3">
<h3 id="org316adf4"><span class="section-number-3">7.4.</span> Commercialization</h3>
<div class="outline-text-3" id="text-7-4">
<p>
Early 1990s: ARPAnet decommissioned, web begins
</p>
<ul class="org-ul">
<li>hypertext</li>
<li>HTML, HTTP: Berners-Lee</li>
</ul>

<p>
1994: Mosaic, later Netscape
</p>

<p>
Late 1990s: commercialization of the web
</p>

<p>
Late 1990s to 2000s:
</p>
<ul class="org-ul">
<li>more applications (instant messaging, file sharing)</li>
<li>network security to forefront</li>
<li>estimated 50 million hosts, 100+ million users</li>
<li>backbone links running at Gbps</li>
</ul>
</div>
</div>
<div id="outline-container-orgc27693f" class="outline-3">
<h3 id="orgc27693f"><span class="section-number-3">7.5.</span> Scale, Mobility, Cloud</h3>
<div class="outline-text-3" id="text-7-5">
<p>
Aggressive deployment of broadband (10-100s Mbps) and increasing ubiquity of high-speed wireless
(4G/5G, WiFi).
</p>

<p>
Service providers create their own networks to connect close to end user.
</p>

<p>
Enterprises run their services in the cloud.
</p>

<p>
2017: rise of smartphones, so more mobile than fixed devices on the Internet, ~18B devices attached to
the Internet
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arnav Gupta</p>
<p class="date">Created: 2024-10-20 Sun 02:49</p>
</div>
</body>
</html>
