3B/ECE358/01-Introduction.tex
\subsection{Internetworking}
\label{sec:org7a57282}
1970: ALOHAnet satellite network in Hawaii

1974, Cerf and Kahn: architecure for interconnecting networks
\begin{itemize}
\item minimalism and autonomy: no internal changes required to interconnected networks
\item best-effort service model
\item stateless routing
\item decentralized control
\end{itemize}

1976: Ethernet at Xerox PARC

1979: ARPAnet at 200 nodes
\subsection{New Protocols}
\label{sec:orgcfa8043}
1983: deployment of TCP/IP

1982: SMTP email protocol defined

1983: DNS defined for name-to-IP-address translation

1988: TCP congestion control

New national networks: CSnet, BITnet, NSFnet, Minitel

100,000 hosts connected to confederation of networks.
\subsection{Commercialization}
\label{sec:orgbb30ee3}
Early 1990s: ARPAnet decommissioned, web begins
\begin{itemize}
\item hypertext
\item HTML, HTTP: Berners-Lee
\end{itemize}

1994: Mosaic, later Netscape

Late 1990s: commercialization of the web

Late 1990s to 2000s:
\begin{itemize}
\item more applications (instant messaging, file sharing)
\item network security to forefront
\item estimated 50 million hosts, 100+ million users
\item backbone links running at Gbps
\end{itemize}
\subsection{Scale, Mobility, Cloud}
\label{sec:org77ab12a}
Aggressive deployment of broadband (10-100s Mbps) and increasing ubiquity of high-speed wireless
(4G/5G, WiFi).

Service providers create their own networks to connect close to end user.

Enterprises run their services in the cloud.

2017: rise of smartphones, so more mobile than fixed devices on the Internet, \textasciitilde{}18B devices attached to
the Internet
\end{document}
